#+title: Phase 2 Stress
* Phase 2 Stress
Preliminary experiments with the stress package on the Poti partition.
Changing:
- CPU
- I/O
- Memory

#+begin_src R
options(crayon.enabled=FALSE)
library(DoE.base)
library(tidyverse)

fator_time   <- c("5m", "10m", "30m")
fator_nodes  <- 1:5

# allowed levels
fator_cpu    <- c(0, 8, 12, 24)
fator_io     <- c(0, 8, 12, 24)
fator_memory <- c(0, 8, 12, 24)

job_name     <- "stress_poti_5_nodes"

# full factorial
fac.design(nfactors = 5,
    replications=2,
    repeat.only = FALSE,
    randomize=TRUE,
    seed=0,
    nlevels  = c(length(fator_time),
                length(fator_cpu),
                length(fator_io),
                length(fator_memory),
                length(fator_nodes)),
    factor.names = list(
        time   = fator_time,
        cpu    = fator_cpu,
        io     = fator_io,
        memory = fator_memory,
        nodes  = fator_nodes
    )) |>
  as_tibble() |>
  mutate(across(c(cpu, io, memory), ~ as.numeric(as.character(.)))) |>
  filter(cpu + io + memory == 24) |>
  filter(time == "5m") |>
  mutate(exp   = job_name) |>
  mutate(Order = paste0(exp,
                        "_", time,
                        "_CPU", cpu,
                        "_IO", io,
                        "_MEM", memory,
                        "_N", nodes,
                        "_", 1:n())) |>
  select(-Blocks) |>
  write_csv(paste0(job_name, "_experimental_project.csv"), progress = FALSE) |>
  print()
#+end_src

#+RESULTS:
| 5m | 12 |  0 | 12 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N4_1  |
| 5m |  0 | 24 |  0 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N1_2   |
| 5m |  0 | 12 | 12 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N5_3  |
| 5m |  0 | 12 | 12 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N1_4  |
| 5m | 12 |  0 | 12 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N5_5  |
| 5m |  0 |  0 | 24 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N1_6   |
| 5m | 12 |  0 | 12 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N3_7  |
| 5m | 12 |  0 | 12 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N1_8  |
| 5m | 12 |  0 | 12 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N2_9  |
| 5m |  0 | 24 |  0 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N2_10  |
| 5m |  0 | 24 |  0 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N3_11  |
| 5m |  0 | 12 | 12 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N4_12 |
| 5m | 12 | 12 |  0 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N1_13 |
| 5m |  8 |  8 |  8 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N5_14   |
| 5m |  8 |  8 |  8 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N3_15   |
| 5m |  0 | 24 |  0 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N4_16  |
| 5m | 12 | 12 |  0 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N5_17 |
| 5m |  0 | 12 | 12 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N2_18 |
| 5m |  8 |  8 |  8 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N2_19   |
| 5m | 24 |  0 |  0 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N4_20  |
| 5m |  0 | 24 |  0 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N5_21  |
| 5m | 12 | 12 |  0 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N2_22 |
| 5m |  0 |  0 | 24 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N3_23  |
| 5m | 24 |  0 |  0 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N2_24  |
| 5m | 24 |  0 |  0 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N1_25  |
| 5m | 12 | 12 |  0 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N3_26 |
| 5m |  0 | 12 | 12 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N3_27 |
| 5m | 24 |  0 |  0 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N3_28  |
| 5m |  8 |  8 |  8 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N4_29   |
| 5m |  0 |  0 | 24 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N4_30  |
| 5m |  0 |  0 | 24 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N5_31  |
| 5m |  0 |  0 | 24 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N2_32  |
| 5m |  8 |  8 |  8 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N1_33   |
| 5m | 24 |  0 |  0 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N5_34  |
| 5m | 12 | 12 |  0 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N4_35 |
| 5m |  0 | 12 | 12 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N1_36 |
| 5m | 12 | 12 |  0 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N2_37 |
| 5m |  0 |  0 | 24 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N3_38  |
| 5m | 24 |  0 |  0 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N4_39  |
| 5m | 12 |  0 | 12 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N5_40 |
| 5m |  8 |  8 |  8 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N1_41   |
| 5m | 12 |  0 | 12 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N4_42 |
| 5m |  0 |  0 | 24 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N4_43  |
| 5m |  0 | 24 |  0 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N3_44  |
| 5m | 12 |  0 | 12 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N1_45 |
| 5m |  0 | 12 | 12 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N5_46 |
| 5m | 12 | 12 |  0 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N4_47 |
| 5m |  0 |  0 | 24 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N5_48  |
| 5m |  0 | 12 | 12 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N3_49 |
| 5m |  8 |  8 |  8 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N4_50   |
| 5m |  0 | 24 |  0 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N1_51  |
| 5m | 12 |  0 | 12 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N3_52 |
| 5m |  8 |  8 |  8 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N5_53   |
| 5m |  0 |  0 | 24 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N1_54  |
| 5m | 24 |  0 |  0 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N2_55  |
| 5m |  8 |  8 |  8 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N2_56   |
| 5m |  0 | 24 |  0 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N4_57  |
| 5m |  0 | 24 |  0 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N5_58  |
| 5m | 24 |  0 |  0 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N3_59  |
| 5m | 24 |  0 |  0 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N5_60  |
| 5m |  0 | 12 | 12 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N2_61 |
| 5m |  0 |  0 | 24 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO0_MEM24_N2_62  |
| 5m |  0 | 24 |  0 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO24_MEM0_N2_63  |
| 5m | 12 | 12 |  0 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N1_64 |
| 5m | 12 |  0 | 12 | 2 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO0_MEM12_N2_65 |
| 5m |  8 |  8 |  8 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU8_IO8_MEM8_N3_66   |
| 5m | 12 | 12 |  0 | 3 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N3_67 |
| 5m |  0 | 12 | 12 | 4 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU0_IO12_MEM12_N4_68 |
| 5m | 12 | 12 |  0 | 5 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU12_IO12_MEM0_N5_69 |
| 5m | 24 |  0 |  0 | 1 | stress_poti_5_nodes | stress_poti_5_nodes_5m_CPU24_IO0_MEM0_N1_70  |
